Revit 2027 API
Field.SubEntityWriteAccessGranted Method
 Checks whether there is write access to subentities storable in this field.
Namespace: Autodesk.Revit.DB.ExtensibleStorage
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool SubEntityWriteAccessGranted()
Public Function SubEntityWriteAccessGranted As Boolean
public:
bool SubEntityWriteAccessGranted()
member SubEntityWriteAccessGranted : unit -> bool
Return Value
Boolean
 True if subentities are writable.
See Also
Reference
Field Class
Autodesk.Revit.DB.ExtensibleStorage Namespace